GopalSaraf/Practicals/PSDL/include/proc/pic18f47q10.h
extern volatile CLC7SEL1bits_t CLC7SEL1bits __at(0xE66);
// bitfield macros
#define _CLC7SEL1_D2S_POSN                                  0x0
#define _CLC7SEL1_D2S_POSITION                              0x0
#define _CLC7SEL1_D2S_SIZE                                  0x8
#define _CLC7SEL1_D2S_LENGTH                                0x8
#define _CLC7SEL1_D2S_MASK                                  0xFF
#define _CLC7SEL1_LC7D2S_POSN                               0x0
#define _CLC7SEL1_LC7D2S_POSITION                           0x0
#define _CLC7SEL1_LC7D2S_SIZE                               0x8
#define _CLC7SEL1_LC7D2S_LENGTH                             0x8
#define _CLC7SEL1_LC7D2S_MASK                               0xFF
#define _CLC7SEL1_D2S0_POSN                                 0x0
#define _CLC7SEL1_D2S0_POSITION                             0x0
#define _CLC7SEL1_D2S0_SIZE                                 0x1
#define _CLC7SEL1_D2S0_LENGTH                               0x1
#define _CLC7SEL1_D2S0_MASK                                 0x1
#define _CLC7SEL1_D2S1_POSN                                 0x1
#define _CLC7SEL1_D2S1_POSITION                             0x1
#define _CLC7SEL1_D2S1_SIZE                                 0x1
#define _CLC7SEL1_D2S1_LENGTH                               0x1
#define _CLC7SEL1_D2S1_MASK                                 0x2
#define _CLC7SEL1_D2S2_POSN                                 0x2
#define _CLC7SEL1_D2S2_POSITION                             0x2
#define _CLC7SEL1_D2S2_SIZE                                 0x1
#define _CLC7SEL1_D2S2_LENGTH                               0x1
#define _CLC7SEL1_D2S2_MASK                                 0x4
#define _CLC7SEL1_D2S3_POSN                                 0x3
#define _CLC7SEL1_D2S3_POSITION                             0x3
#define _CLC7SEL1_D2S3_SIZE                                 0x1
#define _CLC7SEL1_D2S3_LENGTH                               0x1
#define _CLC7SEL1_D2S3_MASK                                 0x8
#define _CLC7SEL1_D2S4_POSN                                 0x4
#define _CLC7SEL1_D2S4_POSITION                             0x4
#define _CLC7SEL1_D2S4_SIZE                                 0x1
#define _CLC7SEL1_D2S4_LENGTH                               0x1
#define _CLC7SEL1_D2S4_MASK                                 0x10
#define _CLC7SEL1_D2S5_POSN                                 0x5
#define _CLC7SEL1_D2S5_POSITION                             0x5
#define _CLC7SEL1_D2S5_SIZE                                 0x1
#define _CLC7SEL1_D2S5_LENGTH                               0x1
#define _CLC7SEL1_D2S5_MASK                                 0x20
#define _CLC7SEL1_D2S6_POSN                                 0x6
#define _CLC7SEL1_D2S6_POSITION                             0x6
#define _CLC7SEL1_D2S6_SIZE                                 0x1
#define _CLC7SEL1_D2S6_LENGTH                               0x1
#define _CLC7SEL1_D2S6_MASK                                 0x40
#define _CLC7SEL1_D2S7_POSN                                 0x7
#define _CLC7SEL1_D2S7_POSITION                             0x7
#define _CLC7SEL1_D2S7_SIZE                                 0x1
#define _CLC7SEL1_D2S7_LENGTH                               0x1
#define _CLC7SEL1_D2S7_MASK                                 0x80
#define _CLC7SEL1_LC7D2S0_POSN                              0x0
#define _CLC7SEL1_LC7D2S0_POSITION                          0x0
#define _CLC7SEL1_LC7D2S0_SIZE                              0x1
#define _CLC7SEL1_LC7D2S0_LENGTH                            0x1
#define _CLC7SEL1_LC7D2S0_MASK                              0x1
#define _CLC7SEL1_LC7D2S1_POSN                              0x1
#define _CLC7SEL1_LC7D2S1_POSITION                          0x1
#define _CLC7SEL1_LC7D2S1_SIZE                              0x1
#define _CLC7SEL1_LC7D2S1_LENGTH                            0x1
#define _CLC7SEL1_LC7D2S1_MASK                              0x2
#define _CLC7SEL1_LC7D2S2_POSN                              0x2
#define _CLC7SEL1_LC7D2S2_POSITION                          0x2
#define _CLC7SEL1_LC7D2S2_SIZE                              0x1
#define _CLC7SEL1_LC7D2S2_LENGTH                            0x1
#define _CLC7SEL1_LC7D2S2_MASK                              0x4
#define _CLC7SEL1_LC7D2S3_POSN                              0x3
#define _CLC7SEL1_LC7D2S3_POSITION                          0x3
#define _CLC7SEL1_LC7D2S3_SIZE                              0x1
#define _CLC7SEL1_LC7D2S3_LENGTH                            0x1
#define _CLC7SEL1_LC7D2S3_MASK                              0x8
#define _CLC7SEL1_LC7D2S4_POSN                              0x4
#define _CLC7SEL1_LC7D2S4_POSITION                          0x4
#define _CLC7SEL1_LC7D2S4_SIZE                              0x1
#define _CLC7SEL1_LC7D2S4_LENGTH                            0x1
#define _CLC7SEL1_LC7D2S4_MASK                              0x10
#define _CLC7SEL1_LC7D2S5_POSN                              0x5
#define _CLC7SEL1_LC7D2S5_POSITION                          0x5
#define _CLC7SEL1_LC7D2S5_SIZE                              0x1
#define _CLC7SEL1_LC7D2S5_LENGTH                            0x1
#define _CLC7SEL1_LC7D2S5_MASK                              0x20
#define _CLC7SEL1_LC7D2S6_POSN                              0x6
#define _CLC7SEL1_LC7D2S6_POSITION                          0x6
#define _CLC7SEL1_LC7D2S6_SIZE                              0x1
#define _CLC7SEL1_LC7D2S6_LENGTH                            0x1
#define _CLC7SEL1_LC7D2S6_MASK                              0x40
#define _CLC7SEL1_LC7D2S7_POSN                              0x7
#define _CLC7SEL1_LC7D2S7_POSITION                          0x7
#define _CLC7SEL1_LC7D2S7_SIZE                              0x1
#define _CLC7SEL1_LC7D2S7_LENGTH                            0x1
#define _CLC7SEL1_LC7D2S7_MASK                              0x80

// Register: CLC7SEL2
#define CLC7SEL2 CLC7SEL2
extern volatile unsigned char           CLC7SEL2            __at(0xE67);
#ifndef _LIB_BUILD
asm("CLC7SEL2 equ 0E67h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned D3S                    :8;
    };
    struct {
        unsigned LC7D3S                 :8;
    };
    struct {
        unsigned D3S0                   :1;
        unsigned D3S1                   :1;
        unsigned D3S2                   :1;
        unsigned D3S3                   :1;
        unsigned D3S4                   :1;
        unsigned D3S5                   :1;
        unsigned D3S6                   :1;
        unsigned D3S7                   :1;
    };
    struct {
        unsigned LC7D3S0                :1;
        unsigned LC7D3S1                :1;
        unsigned LC7D3S2                :1;
        unsigned LC7D3S3                :1;
        unsigned LC7D3S4                :1;
        unsigned LC7D3S5                :1;
        unsigned LC7D3S6                :1;
        unsigned LC7D3S7                :1;
    };
} CLC7SEL2bits_t;
extern volatile CLC7SEL2bits_t CLC7SEL2bits __at(0xE67);
// bitfield macros
#define _CLC7SEL2_D3S_POSN                                  0x0
#define _CLC7SEL2_D3S_POSITION                              0x0
#define _CLC7SEL2_D3S_SIZE                                  0x8
#define _CLC7SEL2_D3S_LENGTH                                0x8
#define _CLC7SEL2_D3S_MASK                                  0xFF
#define _CLC7SEL2_LC7D3S_POSN                               0x0
#define _CLC7SEL2_LC7D3S_POSITION                           0x0
#define _CLC7SEL2_LC7D3S_SIZE                               0x8
#define _CLC7SEL2_LC7D3S_LENGTH                             0x8
#define _CLC7SEL2_LC7D3S_MASK                               0xFF
#define _CLC7SEL2_D3S0_POSN                                 0x0
#define _CLC7SEL2_D3S0_POSITION                             0x0
#define _CLC7SEL2_D3S0_SIZE                                 0x1
#define _CLC7SEL2_D3S0_LENGTH                               0x1
#define _CLC7SEL2_D3S0_MASK                                 0x1
#define _CLC7SEL2_D3S1_POSN                                 0x1
#define _CLC7SEL2_D3S1_POSITION                             0x1
#define _CLC7SEL2_D3S1_SIZE                                 0x1
#define _CLC7SEL2_D3S1_LENGTH                               0x1
#define _CLC7SEL2_D3S1_MASK                                 0x2
#define _CLC7SEL2_D3S2_POSN                                 0x2
#define _CLC7SEL2_D3S2_POSITION                             0x2
#define _CLC7SEL2_D3S2_SIZE                                 0x1
#define _CLC7SEL2_D3S2_LENGTH                               0x1
#define _CLC7SEL2_D3S2_MASK                                 0x4
#define _CLC7SEL2_D3S3_POSN                                 0x3
#define _CLC7SEL2_D3S3_POSITION                             0x3
#define _CLC7SEL2_D3S3_SIZE                                 0x1
#define _CLC7SEL2_D3S3_LENGTH                               0x1
#define _CLC7SEL2_D3S3_MASK                                 0x8
#define _CLC7SEL2_D3S4_POSN                                 0x4
#define _CLC7SEL2_D3S4_POSITION                             0x4
#define _CLC7SEL2_D3S4_SIZE                                 0x1
#define _CLC7SEL2_D3S4_LENGTH                               0x1
#define _CLC7SEL2_D3S4_MASK                                 0x10
#define _CLC7SEL2_D3S5_POSN                                 0x5
#define _CLC7SEL2_D3S5_POSITION                             0x5
#define _CLC7SEL2_D3S5_SIZE                                 0x1
#define _CLC7SEL2_D3S5_LENGTH                               0x1
#define _CLC7SEL2_D3S5_MASK                                 0x20
#define _CLC7SEL2_D3S6_POSN                                 0x6
#define _CLC7SEL2_D3S6_POSITION                             0x6
#define _CLC7SEL2_D3S6_SIZE                                 0x1
#define _CLC7SEL2_D3S6_LENGTH                               0x1
#define _CLC7SEL2_D3S6_MASK                                 0x40
#define _CLC7SEL2_D3S7_POSN                                 0x7
#define _CLC7SEL2_D3S7_POSITION                             0x7
#define _CLC7SEL2_D3S7_SIZE                                 0x1
#define _CLC7SEL2_D3S7_LENGTH                               0x1
#define _CLC7SEL2_D3S7_MASK                                 0x80
#define _CLC7SEL2_LC7D3S0_POSN                              0x0
#define _CLC7SEL2_LC7D3S0_POSITION                          0x0
#define _CLC7SEL2_LC7D3S0_SIZE                              0x1
#define _CLC7SEL2_LC7D3S0_LENGTH                            0x1
#define _CLC7SEL2_LC7D3S0_MASK                              0x1
#define _CLC7SEL2_LC7D3S1_POSN                              0x1
#define _CLC7SEL2_LC7D3S1_POSITION                          0x1
#define _CLC7SEL2_LC7D3S1_SIZE                              0x1
#define _CLC7SEL2_LC7D3S1_LENGTH                            0x1
#define _CLC7SEL2_LC7D3S1_MASK                              0x2
#define _CLC7SEL2_LC7D3S2_POSN                              0x2
#define _CLC7SEL2_LC7D3S2_POSITION                          0x2
#define _CLC7SEL2_LC7D3S2_SIZE                              0x1
#define _CLC7SEL2_LC7D3S2_LENGTH                            0x1
#define _CLC7SEL2_LC7D3S2_MASK                              0x4
#define _CLC7SEL2_LC7D3S3_POSN                              0x3
#define _CLC7SEL2_LC7D3S3_POSITION                          0x3
#define _CLC7SEL2_LC7D3S3_SIZE                              0x1
#define _CLC7SEL2_LC7D3S3_LENGTH                            0x1
#define _CLC7SEL2_LC7D3S3_MASK                              0x8
#define _CLC7SEL2_LC7D3S4_POSN                              0x4
#define _CLC7SEL2_LC7D3S4_POSITION                          0x4
#define _CLC7SEL2_LC7D3S4_SIZE                              0x1
#define _CLC7SEL2_LC7D3S4_LENGTH                            0x1
#define _CLC7SEL2_LC7D3S4_MASK                              0x10
#define _CLC7SEL2_LC7D3S5_POSN                              0x5
#define _CLC7SEL2_LC7D3S5_POSITION                          0x5
#define _CLC7SEL2_LC7D3S5_SIZE                              0x1
#define _CLC7SEL2_LC7D3S5_LENGTH                            0x1
#define _CLC7SEL2_LC7D3S5_MASK                              0x20
#define _CLC7SEL2_LC7D3S6_POSN                              0x6
#define _CLC7SEL2_LC7D3S6_POSITION                          0x6
#define _CLC7SEL2_LC7D3S6_SIZE                              0x1
#define _CLC7SEL2_LC7D3S6_LENGTH                            0x1
#define _CLC7SEL2_LC7D3S6_MASK                              0x40
#define _CLC7SEL2_LC7D3S7_POSN                              0x7
#define _CLC7SEL2_LC7D3S7_POSITION                          0x7
#define _CLC7SEL2_LC7D3S7_SIZE                              0x1
#define _CLC7SEL2_LC7D3S7_LENGTH                            0x1
#define _CLC7SEL2_LC7D3S7_MASK                              0x80

// Register: CLC7SEL3
#define CLC7SEL3 CLC7SEL3
extern volatile unsigned char           CLC7SEL3            __at(0xE68);
#ifndef _LIB_BUILD
asm("CLC7SEL3 equ 0E68h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned D4S                    :8;
    };
    struct {
        unsigned LC7D4S                 :8;
    };
    struct {
        unsigned D4S0                   :1;
        unsigned D4S1                   :1;
        unsigned D4S2                   :1;
        unsigned D4S3                   :1;
        unsigned D4S4                   :1;
        unsigned D4S5                   :1;
        unsigned D4S6                   :1;
        unsigned D4S7                   :1;
    };
    struct {
        unsigned LC7D4S0                :1;
        unsigned LC7D4S1                :1;
        unsigned LC7D4S2                :1;
        unsigned LC7D4S3                :1;
        unsigned LC7D4S4                :1;
        unsigned LC7D4S5                :1;
        unsigned LC7D4S6                :1;
        unsigned LC7D4S7                :1;
    };
} CLC7SEL3bits_t;
extern volatile CLC7SEL3bits_t CLC7SEL3bits __at(0xE68);
// bitfield macros
#define _CLC7SEL3_D4S_POSN                                  0x0
#define _CLC7SEL3_D4S_POSITION                              0x0
#define _CLC7SEL3_D4S_SIZE                                  0x8
#define _CLC7SEL3_D4S_LENGTH                                0x8
#define _CLC7SEL3_D4S_MASK                                  0xFF
#define _CLC7SEL3_LC7D4S_POSN                               0x0
#define _CLC7SEL3_LC7D4S_POSITION                           0x0
#define _CLC7SEL3_LC7D4S_SIZE                               0x8
#define _CLC7SEL3_LC7D4S_LENGTH                             0x8
#define _CLC7SEL3_LC7D4S_MASK                               0xFF
#define _CLC7SEL3_D4S0_POSN                                 0x0
#define _CLC7SEL3_D4S0_POSITION                             0x0
#define _CLC7SEL3_D4S0_SIZE                                 0x1
#define _CLC7SEL3_D4S0_LENGTH                               0x1
#define _CLC7SEL3_D4S0_MASK                                 0x1
#define _CLC7SEL3_D4S1_POSN                                 0x1
#define _CLC7SEL3_D4S1_POSITION                             0x1
#define _CLC7SEL3_D4S1_SIZE                                 0x1
#define _CLC7SEL3_D4S1_LENGTH                               0x1
#define _CLC7SEL3_D4S1_MASK                                 0x2
#define _CLC7SEL3_D4S2_POSN                                 0x2
#define _CLC7SEL3_D4S2_POSITION                             0x2
#define _CLC7SEL3_D4S2_SIZE                                 0x1
#define _CLC7SEL3_D4S2_LENGTH                               0x1
#define _CLC7SEL3_D4S2_MASK                                 0x4
#define _CLC7SEL3_D4S3_POSN                                 0x3
#define _CLC7SEL3_D4S3_POSITION                             0x3
#define _CLC7SEL3_D4S3_SIZE                                 0x1
#define _CLC7SEL3_D4S3_LENGTH                               0x1
#define _CLC7SEL3_D4S3_MASK                                 0x8
#define _CLC7SEL3_D4S4_POSN                                 0x4
#define _CLC7SEL3_D4S4_POSITION                             0x4
#define _CLC7SEL3_D4S4_SIZE                                 0x1
#define _CLC7SEL3_D4S4_LENGTH                               0x1
#define _CLC7SEL3_D4S4_MASK                                 0x10
#define _CLC7SEL3_D4S5_POSN                                 0x5
#define _CLC7SEL3_D4S5_POSITION                             0x5
#define _CLC7SEL3_D4S5_SIZE                                 0x1
#define _CLC7SEL3_D4S5_LENGTH                               0x1
#define _CLC7SEL3_D4S5_MASK                                 0x20
#define _CLC7SEL3_D4S6_POSN                                 0x6
#define _CLC7SEL3_D4S6_POSITION                             0x6
#define _CLC7SEL3_D4S6_SIZE                                 0x1
#define _CLC7SEL3_D4S6_LENGTH                               0x1
#define _CLC7SEL3_D4S6_MASK                                 0x40
#define _CLC7SEL3_D4S7_POSN                                 0x7
#define _CLC7SEL3_D4S7_POSITION                             0x7
#define _CLC7SEL3_D4S7_SIZE                                 0x1
#define _CLC7SEL3_D4S7_LENGTH                               0x1
#define _CLC7SEL3_D4S7_MASK                                 0x80
#define _CLC7SEL3_LC7D4S0_POSN                              0x0
#define _CLC7SEL3_LC7D4S0_POSITION                          0x0
#define _CLC7SEL3_LC7D4S0_SIZE                              0x1
#define _CLC7SEL3_LC7D4S0_LENGTH                            0x1
#define _CLC7SEL3_LC7D4S0_MASK                              0x1
#define _CLC7SEL3_LC7D4S1_POSN                              0x1
#define _CLC7SEL3_LC7D4S1_POSITION                          0x1
#define _CLC7SEL3_LC7D4S1_SIZE                              0x1
#define _CLC7SEL3_LC7D4S1_LENGTH                            0x1
#define _CLC7SEL3_LC7D4S1_MASK                              0x2
#define _CLC7SEL3_LC7D4S2_POSN                              0x2
#define _CLC7SEL3_LC7D4S2_POSITION                          0x2
#define _CLC7SEL3_LC7D4S2_SIZE                              0x1
#define _CLC7SEL3_LC7D4S2_LENGTH                            0x1
#define _CLC7SEL3_LC7D4S2_MASK                              0x4
#define _CLC7SEL3_LC7D4S3_POSN                              0x3
#define _CLC7SEL3_LC7D4S3_POSITION                          0x3
#define _CLC7SEL3_LC7D4S3_SIZE                              0x1
#define _CLC7SEL3_LC7D4S3_LENGTH                            0x1
#define _CLC7SEL3_LC7D4S3_MASK                              0x8
#define _CLC7SEL3_LC7D4S4_POSN                              0x4
#define _CLC7SEL3_LC7D4S4_POSITION                          0x4
#define _CLC7SEL3_LC7D4S4_SIZE                              0x1
#define _CLC7SEL3_LC7D4S4_LENGTH                            0x1
#define _CLC7SEL3_LC7D4S4_MASK                              0x10
#define _CLC7SEL3_LC7D4S5_POSN                              0x5
#define _CLC7SEL3_LC7D4S5_POSITION                          0x5
#define _CLC7SEL3_LC7D4S5_SIZE                              0x1
#define _CLC7SEL3_LC7D4S5_LENGTH                            0x1
#define _CLC7SEL3_LC7D4S5_MASK                              0x20
#define _CLC7SEL3_LC7D4S6_POSN                              0x6
#define _CLC7SEL3_LC7D4S6_POSITION                          0x6
#define _CLC7SEL3_LC7D4S6_SIZE                              0x1
#define _CLC7SEL3_LC7D4S6_LENGTH                            0x1
#define _CLC7SEL3_LC7D4S6_MASK                              0x40
#define _CLC7SEL3_LC7D4S7_POSN                              0x7
#define _CLC7SEL3_LC7D4S7_POSITION                          0x7
#define _CLC7SEL3_LC7D4S7_SIZE                              0x1
#define _CLC7SEL3_LC7D4S7_LENGTH                            0x1
#define _CLC7SEL3_LC7D4S7_MASK                              0x80

