GopalSaraf/Practicals/PSDL/include/proc/pic18f47q10.h
// Register: PIR5
#define PIR5 PIR5
extern volatile unsigned char           PIR5                __at(0xECA);
#ifndef _LIB_BUILD
asm("PIR5 equ 0ECAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1GIF                :1;
        unsigned TMR3GIF                :1;
        unsigned TMR5GIF                :1;
        unsigned                        :1;
        unsigned CLC1IF                 :1;
        unsigned CLC2IF                 :1;
        unsigned CLC3IF                 :1;
        unsigned CLC4IF                 :1;
    };
} PIR5bits_t;
extern volatile PIR5bits_t PIR5bits __at(0xECA);
// bitfield macros
#define _PIR5_TMR1GIF_POSN                                  0x0
#define _PIR5_TMR1GIF_POSITION                              0x0
#define _PIR5_TMR1GIF_SIZE                                  0x1
#define _PIR5_TMR1GIF_LENGTH                                0x1
#define _PIR5_TMR1GIF_MASK                                  0x1
#define _PIR5_TMR3GIF_POSN                                  0x1
#define _PIR5_TMR3GIF_POSITION                              0x1
#define _PIR5_TMR3GIF_SIZE                                  0x1
#define _PIR5_TMR3GIF_LENGTH                                0x1
#define _PIR5_TMR3GIF_MASK                                  0x2
#define _PIR5_TMR5GIF_POSN                                  0x2
#define _PIR5_TMR5GIF_POSITION                              0x2
#define _PIR5_TMR5GIF_SIZE                                  0x1
#define _PIR5_TMR5GIF_LENGTH                                0x1
#define _PIR5_TMR5GIF_MASK                                  0x4
#define _PIR5_CLC1IF_POSN                                   0x4
#define _PIR5_CLC1IF_POSITION                               0x4
#define _PIR5_CLC1IF_SIZE                                   0x1
#define _PIR5_CLC1IF_LENGTH                                 0x1
#define _PIR5_CLC1IF_MASK                                   0x10
#define _PIR5_CLC2IF_POSN                                   0x5
#define _PIR5_CLC2IF_POSITION                               0x5
#define _PIR5_CLC2IF_SIZE                                   0x1
#define _PIR5_CLC2IF_LENGTH                                 0x1
#define _PIR5_CLC2IF_MASK                                   0x20
#define _PIR5_CLC3IF_POSN                                   0x6
#define _PIR5_CLC3IF_POSITION                               0x6
#define _PIR5_CLC3IF_SIZE                                   0x1
#define _PIR5_CLC3IF_LENGTH                                 0x1
#define _PIR5_CLC3IF_MASK                                   0x40
#define _PIR5_CLC4IF_POSN                                   0x7
#define _PIR5_CLC4IF_POSITION                               0x7
#define _PIR5_CLC4IF_SIZE                                   0x1
#define _PIR5_CLC4IF_LENGTH                                 0x1
#define _PIR5_CLC4IF_MASK                                   0x80

// Register: PIR6
#define PIR6 PIR6
extern volatile unsigned char           PIR6                __at(0xECB);
#ifndef _LIB_BUILD
asm("PIR6 equ 0ECBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1IF                 :1;
        unsigned CCP2IF                 :1;
        unsigned                        :2;
        unsigned CLC5IF                 :1;
        unsigned CLC6IF                 :1;
        unsigned CLC7IF                 :1;
        unsigned CLC8IF                 :1;
    };
} PIR6bits_t;
extern volatile PIR6bits_t PIR6bits __at(0xECB);
// bitfield macros
#define _PIR6_CCP1IF_POSN                                   0x0
#define _PIR6_CCP1IF_POSITION                               0x0
#define _PIR6_CCP1IF_SIZE                                   0x1
#define _PIR6_CCP1IF_LENGTH                                 0x1
#define _PIR6_CCP1IF_MASK                                   0x1
#define _PIR6_CCP2IF_POSN                                   0x1
#define _PIR6_CCP2IF_POSITION                               0x1
#define _PIR6_CCP2IF_SIZE                                   0x1
#define _PIR6_CCP2IF_LENGTH                                 0x1
#define _PIR6_CCP2IF_MASK                                   0x2
#define _PIR6_CLC5IF_POSN                                   0x4
#define _PIR6_CLC5IF_POSITION                               0x4
#define _PIR6_CLC5IF_SIZE                                   0x1
#define _PIR6_CLC5IF_LENGTH                                 0x1
#define _PIR6_CLC5IF_MASK                                   0x10
#define _PIR6_CLC6IF_POSN                                   0x5
#define _PIR6_CLC6IF_POSITION                               0x5
#define _PIR6_CLC6IF_SIZE                                   0x1
#define _PIR6_CLC6IF_LENGTH                                 0x1
#define _PIR6_CLC6IF_MASK                                   0x20
#define _PIR6_CLC7IF_POSN                                   0x6
#define _PIR6_CLC7IF_POSITION                               0x6
#define _PIR6_CLC7IF_SIZE                                   0x1
#define _PIR6_CLC7IF_LENGTH                                 0x1
#define _PIR6_CLC7IF_MASK                                   0x40
#define _PIR6_CLC8IF_POSN                                   0x7
#define _PIR6_CLC8IF_POSITION                               0x7
#define _PIR6_CLC8IF_SIZE                                   0x1
#define _PIR6_CLC8IF_LENGTH                                 0x1
#define _PIR6_CLC8IF_MASK                                   0x80

// Register: PIR7
#define PIR7 PIR7
extern volatile unsigned char           PIR7                __at(0xECC);
#ifndef _LIB_BUILD
asm("PIR7 equ 0ECCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CWGIF                  :1;
        unsigned                        :4;
        unsigned NVMIF                  :1;
        unsigned CRCIF                  :1;
        unsigned SCANIF                 :1;
    };
    struct {
        unsigned CWG1IF                 :1;
    };
} PIR7bits_t;
extern volatile PIR7bits_t PIR7bits __at(0xECC);
// bitfield macros
#define _PIR7_CWGIF_POSN                                    0x0
#define _PIR7_CWGIF_POSITION                                0x0
#define _PIR7_CWGIF_SIZE                                    0x1
#define _PIR7_CWGIF_LENGTH                                  0x1
#define _PIR7_CWGIF_MASK                                    0x1
#define _PIR7_NVMIF_POSN                                    0x5
#define _PIR7_NVMIF_POSITION                                0x5
#define _PIR7_NVMIF_SIZE                                    0x1
#define _PIR7_NVMIF_LENGTH                                  0x1
#define _PIR7_NVMIF_MASK                                    0x20
#define _PIR7_CRCIF_POSN                                    0x6
#define _PIR7_CRCIF_POSITION                                0x6
#define _PIR7_CRCIF_SIZE                                    0x1
#define _PIR7_CRCIF_LENGTH                                  0x1
#define _PIR7_CRCIF_MASK                                    0x40
#define _PIR7_SCANIF_POSN                                   0x7
#define _PIR7_SCANIF_POSITION                               0x7
#define _PIR7_SCANIF_SIZE                                   0x1
#define _PIR7_SCANIF_LENGTH                                 0x1
#define _PIR7_SCANIF_MASK                                   0x80
#define _PIR7_CWG1IF_POSN                                   0x0
#define _PIR7_CWG1IF_POSITION                               0x0
#define _PIR7_CWG1IF_SIZE                                   0x1
#define _PIR7_CWG1IF_LENGTH                                 0x1
#define _PIR7_CWG1IF_MASK                                   0x1

// Register: WDTCON0
#define WDTCON0 WDTCON0
extern volatile unsigned char           WDTCON0             __at(0xECD);
#ifndef _LIB_BUILD
asm("WDTCON0 equ 0ECDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEN                    :1;
        unsigned WDTPS                  :5;
    };
    struct {
        unsigned SWDTEN                 :1;
    };
    struct {
        unsigned WDTSEN                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned WDTPS0                 :1;
        unsigned WDTPS1                 :1;
        unsigned WDTPS2                 :1;
        unsigned WDTPS3                 :1;
        unsigned WDTPS4                 :1;
    };
} WDTCON0bits_t;
