GopalSaraf/Practicals/PSDL/include/proc/pic18f47q10.h
// Register: NVMADRH
#define NVMADRH NVMADRH
extern volatile unsigned char           NVMADRH             __at(0xF7A);
#ifndef _LIB_BUILD
asm("NVMADRH equ 0F7Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMADRH                :8;
    };
    struct {
        unsigned NVMADR8                :1;
        unsigned NVMADR9                :1;
        unsigned NVMADR10               :1;
        unsigned NVMADR11               :1;
        unsigned NVMADR12               :1;
        unsigned NVMADR13               :1;
        unsigned NVMADR14               :1;
        unsigned NVMADR15               :1;
    };
} NVMADRHbits_t;
extern volatile NVMADRHbits_t NVMADRHbits __at(0xF7A);
// bitfield macros
#define _NVMADRH_NVMADRH_POSN                               0x0
#define _NVMADRH_NVMADRH_POSITION                           0x0
#define _NVMADRH_NVMADRH_SIZE                               0x8
#define _NVMADRH_NVMADRH_LENGTH                             0x8
#define _NVMADRH_NVMADRH_MASK                               0xFF
#define _NVMADRH_NVMADR8_POSN                               0x0
#define _NVMADRH_NVMADR8_POSITION                           0x0
#define _NVMADRH_NVMADR8_SIZE                               0x1
#define _NVMADRH_NVMADR8_LENGTH                             0x1
#define _NVMADRH_NVMADR8_MASK                               0x1
#define _NVMADRH_NVMADR9_POSN                               0x1
#define _NVMADRH_NVMADR9_POSITION                           0x1
#define _NVMADRH_NVMADR9_SIZE                               0x1
#define _NVMADRH_NVMADR9_LENGTH                             0x1
#define _NVMADRH_NVMADR9_MASK                               0x2
#define _NVMADRH_NVMADR10_POSN                              0x2
#define _NVMADRH_NVMADR10_POSITION                          0x2
#define _NVMADRH_NVMADR10_SIZE                              0x1
#define _NVMADRH_NVMADR10_LENGTH                            0x1
#define _NVMADRH_NVMADR10_MASK                              0x4
#define _NVMADRH_NVMADR11_POSN                              0x3
#define _NVMADRH_NVMADR11_POSITION                          0x3
#define _NVMADRH_NVMADR11_SIZE                              0x1
#define _NVMADRH_NVMADR11_LENGTH                            0x1
#define _NVMADRH_NVMADR11_MASK                              0x8
#define _NVMADRH_NVMADR12_POSN                              0x4
#define _NVMADRH_NVMADR12_POSITION                          0x4
#define _NVMADRH_NVMADR12_SIZE                              0x1
#define _NVMADRH_NVMADR12_LENGTH                            0x1
#define _NVMADRH_NVMADR12_MASK                              0x10
#define _NVMADRH_NVMADR13_POSN                              0x5
#define _NVMADRH_NVMADR13_POSITION                          0x5
#define _NVMADRH_NVMADR13_SIZE                              0x1
#define _NVMADRH_NVMADR13_LENGTH                            0x1
#define _NVMADRH_NVMADR13_MASK                              0x20
#define _NVMADRH_NVMADR14_POSN                              0x6
#define _NVMADRH_NVMADR14_POSITION                          0x6
#define _NVMADRH_NVMADR14_SIZE                              0x1
#define _NVMADRH_NVMADR14_LENGTH                            0x1
#define _NVMADRH_NVMADR14_MASK                              0x40
#define _NVMADRH_NVMADR15_POSN                              0x7
#define _NVMADRH_NVMADR15_POSITION                          0x7
#define _NVMADRH_NVMADR15_SIZE                              0x1
#define _NVMADRH_NVMADR15_LENGTH                            0x1
#define _NVMADRH_NVMADR15_MASK                              0x80

// Register: NVMADRU
#define NVMADRU NVMADRU
extern volatile unsigned char           NVMADRU             __at(0xF7B);
#ifndef _LIB_BUILD
asm("NVMADRU equ 0F7Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMADRU                :6;
    };
    struct {
        unsigned NVMADR16               :1;
        unsigned NVMADR17               :1;
        unsigned NVMADR18               :1;
        unsigned NVMADR19               :1;
        unsigned NVMADR20               :1;
        unsigned NVMADR21               :1;
    };
} NVMADRUbits_t;
extern volatile NVMADRUbits_t NVMADRUbits __at(0xF7B);
// bitfield macros
#define _NVMADRU_NVMADRU_POSN                               0x0
#define _NVMADRU_NVMADRU_POSITION                           0x0
#define _NVMADRU_NVMADRU_SIZE                               0x6
#define _NVMADRU_NVMADRU_LENGTH                             0x6
#define _NVMADRU_NVMADRU_MASK                               0x3F
#define _NVMADRU_NVMADR16_POSN                              0x0
#define _NVMADRU_NVMADR16_POSITION                          0x0
#define _NVMADRU_NVMADR16_SIZE                              0x1
#define _NVMADRU_NVMADR16_LENGTH                            0x1
#define _NVMADRU_NVMADR16_MASK                              0x1
#define _NVMADRU_NVMADR17_POSN                              0x1
#define _NVMADRU_NVMADR17_POSITION                          0x1
#define _NVMADRU_NVMADR17_SIZE                              0x1
#define _NVMADRU_NVMADR17_LENGTH                            0x1
#define _NVMADRU_NVMADR17_MASK                              0x2
#define _NVMADRU_NVMADR18_POSN                              0x2
#define _NVMADRU_NVMADR18_POSITION                          0x2
#define _NVMADRU_NVMADR18_SIZE                              0x1
#define _NVMADRU_NVMADR18_LENGTH                            0x1
#define _NVMADRU_NVMADR18_MASK                              0x4
#define _NVMADRU_NVMADR19_POSN                              0x3
#define _NVMADRU_NVMADR19_POSITION                          0x3
#define _NVMADRU_NVMADR19_SIZE                              0x1
#define _NVMADRU_NVMADR19_LENGTH                            0x1
#define _NVMADRU_NVMADR19_MASK                              0x8
#define _NVMADRU_NVMADR20_POSN                              0x4
#define _NVMADRU_NVMADR20_POSITION                          0x4
#define _NVMADRU_NVMADR20_SIZE                              0x1
#define _NVMADRU_NVMADR20_LENGTH                            0x1
#define _NVMADRU_NVMADR20_MASK                              0x10
#define _NVMADRU_NVMADR21_POSN                              0x5
#define _NVMADRU_NVMADR21_POSITION                          0x5
#define _NVMADRU_NVMADR21_SIZE                              0x1
#define _NVMADRU_NVMADR21_LENGTH                            0x1
#define _NVMADRU_NVMADR21_MASK                              0x20

// Register: NVMDAT
#define NVMDAT NVMDAT
extern volatile unsigned short          NVMDAT              __at(0xF7C);
#ifndef _LIB_BUILD
asm("NVMDAT equ 0F7Ch");
#endif

// Register: NVMDATL
#define NVMDATL NVMDATL
extern volatile unsigned char           NVMDATL             __at(0xF7C);
#ifndef _LIB_BUILD
asm("NVMDATL equ 0F7Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMDATL                :8;
    };
    struct {
        unsigned NVMDAT0                :1;
        unsigned NVMDAT1                :1;
        unsigned NVMDAT2                :1;
        unsigned NVMDAT3                :1;
        unsigned NVMDAT4                :1;
        unsigned NVMDAT5                :1;
        unsigned NVMDAT6                :1;
        unsigned NVMDAT7                :1;
    };
} NVMDATLbits_t;
extern volatile NVMDATLbits_t NVMDATLbits __at(0xF7C);
// bitfield macros
#define _NVMDATL_NVMDATL_POSN                               0x0
#define _NVMDATL_NVMDATL_POSITION                           0x0
#define _NVMDATL_NVMDATL_SIZE                               0x8
#define _NVMDATL_NVMDATL_LENGTH                             0x8
#define _NVMDATL_NVMDATL_MASK                               0xFF
#define _NVMDATL_NVMDAT0_POSN                               0x0
#define _NVMDATL_NVMDAT0_POSITION                           0x0
#define _NVMDATL_NVMDAT0_SIZE                               0x1
#define _NVMDATL_NVMDAT0_LENGTH                             0x1
#define _NVMDATL_NVMDAT0_MASK                               0x1
#define _NVMDATL_NVMDAT1_POSN                               0x1
#define _NVMDATL_NVMDAT1_POSITION                           0x1
#define _NVMDATL_NVMDAT1_SIZE                               0x1
#define _NVMDATL_NVMDAT1_LENGTH                             0x1
#define _NVMDATL_NVMDAT1_MASK                               0x2
#define _NVMDATL_NVMDAT2_POSN                               0x2
#define _NVMDATL_NVMDAT2_POSITION                           0x2
#define _NVMDATL_NVMDAT2_SIZE                               0x1
#define _NVMDATL_NVMDAT2_LENGTH                             0x1
#define _NVMDATL_NVMDAT2_MASK                               0x4
#define _NVMDATL_NVMDAT3_POSN                               0x3
#define _NVMDATL_NVMDAT3_POSITION                           0x3
#define _NVMDATL_NVMDAT3_SIZE                               0x1
#define _NVMDATL_NVMDAT3_LENGTH                             0x1
#define _NVMDATL_NVMDAT3_MASK                               0x8
#define _NVMDATL_NVMDAT4_POSN                               0x4
#define _NVMDATL_NVMDAT4_POSITION                           0x4
#define _NVMDATL_NVMDAT4_SIZE                               0x1
#define _NVMDATL_NVMDAT4_LENGTH                             0x1
#define _NVMDATL_NVMDAT4_MASK                               0x10
#define _NVMDATL_NVMDAT5_POSN                               0x5
#define _NVMDATL_NVMDAT5_POSITION                           0x5
#define _NVMDATL_NVMDAT5_SIZE                               0x1
#define _NVMDATL_NVMDAT5_LENGTH                             0x1
#define _NVMDATL_NVMDAT5_MASK                               0x20
#define _NVMDATL_NVMDAT6_POSN                               0x6
#define _NVMDATL_NVMDAT6_POSITION                           0x6
#define _NVMDATL_NVMDAT6_SIZE                               0x1
#define _NVMDATL_NVMDAT6_LENGTH                             0x1
#define _NVMDATL_NVMDAT6_MASK                               0x40
#define _NVMDATL_NVMDAT7_POSN                               0x7
#define _NVMDATL_NVMDAT7_POSITION                           0x7
#define _NVMDATL_NVMDAT7_SIZE                               0x1
#define _NVMDATL_NVMDAT7_LENGTH                             0x1
#define _NVMDATL_NVMDAT7_MASK                               0x80

// Register: NVMDATH
#define NVMDATH NVMDATH
extern volatile unsigned char           NVMDATH             __at(0xF7D);
#ifndef _LIB_BUILD
asm("NVMDATH equ 0F7Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMDATH                :8;
    };
    struct {
        unsigned NVMDAT8                :1;
        unsigned NVMDAT9                :1;
        unsigned NVMDAT10               :1;
        unsigned NVMDAT11               :1;
        unsigned NVMDAT12               :1;
        unsigned NVMDAT13               :1;
        unsigned NVMDAT14               :1;
        unsigned NVMDAT15               :1;
    };
} NVMDATHbits_t;
extern volatile NVMDATHbits_t NVMDATHbits __at(0xF7D);
// bitfield macros
#define _NVMDATH_NVMDATH_POSN                               0x0
#define _NVMDATH_NVMDATH_POSITION                           0x0
#define _NVMDATH_NVMDATH_SIZE                               0x8
#define _NVMDATH_NVMDATH_LENGTH                             0x8
#define _NVMDATH_NVMDATH_MASK                               0xFF
#define _NVMDATH_NVMDAT8_POSN                               0x0
#define _NVMDATH_NVMDAT8_POSITION                           0x0
#define _NVMDATH_NVMDAT8_SIZE                               0x1
#define _NVMDATH_NVMDAT8_LENGTH                             0x1
#define _NVMDATH_NVMDAT8_MASK                               0x1
#define _NVMDATH_NVMDAT9_POSN                               0x1
#define _NVMDATH_NVMDAT9_POSITION                           0x1
#define _NVMDATH_NVMDAT9_SIZE                               0x1
#define _NVMDATH_NVMDAT9_LENGTH                             0x1
#define _NVMDATH_NVMDAT9_MASK                               0x2
#define _NVMDATH_NVMDAT10_POSN                              0x2
#define _NVMDATH_NVMDAT10_POSITION                          0x2
#define _NVMDATH_NVMDAT10_SIZE                              0x1
#define _NVMDATH_NVMDAT10_LENGTH                            0x1
#define _NVMDATH_NVMDAT10_MASK                              0x4
#define _NVMDATH_NVMDAT11_POSN                              0x3
#define _NVMDATH_NVMDAT11_POSITION                          0x3
#define _NVMDATH_NVMDAT11_SIZE                              0x1
#define _NVMDATH_NVMDAT11_LENGTH                            0x1
#define _NVMDATH_NVMDAT11_MASK                              0x8
#define _NVMDATH_NVMDAT12_POSN                              0x4
#define _NVMDATH_NVMDAT12_POSITION                          0x4
#define _NVMDATH_NVMDAT12_SIZE                              0x1
#define _NVMDATH_NVMDAT12_LENGTH                            0x1
#define _NVMDATH_NVMDAT12_MASK                              0x10
#define _NVMDATH_NVMDAT13_POSN                              0x5
#define _NVMDATH_NVMDAT13_POSITION                          0x5
#define _NVMDATH_NVMDAT13_SIZE                              0x1
#define _NVMDATH_NVMDAT13_LENGTH                            0x1
#define _NVMDATH_NVMDAT13_MASK                              0x20
#define _NVMDATH_NVMDAT14_POSN                              0x6
#define _NVMDATH_NVMDAT14_POSITION                          0x6
#define _NVMDATH_NVMDAT14_SIZE                              0x1
#define _NVMDATH_NVMDAT14_LENGTH                            0x1
#define _NVMDATH_NVMDAT14_MASK                              0x40
#define _NVMDATH_NVMDAT15_POSN                              0x7
#define _NVMDATH_NVMDAT15_POSITION                          0x7
#define _NVMDATH_NVMDAT15_SIZE                              0x1
#define _NVMDATH_NVMDAT15_LENGTH                            0x1
#define _NVMDATH_NVMDAT15_MASK                              0x80

// Register: NVMCON0
#define NVMCON0 NVMCON0
extern volatile unsigned char           NVMCON0             __at(0xF7F);
#ifndef _LIB_BUILD
asm("NVMCON0 equ 0F7Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned NVMERR                 :1;
        unsigned                        :2;
        unsigned NVMEN                  :1;
    };
} NVMCON0bits_t;
extern volatile NVMCON0bits_t NVMCON0bits __at(0xF7F);
// bitfield macros
#define _NVMCON0_NVMERR_POSN                                0x4
#define _NVMCON0_NVMERR_POSITION                            0x4
#define _NVMCON0_NVMERR_SIZE                                0x1
#define _NVMCON0_NVMERR_LENGTH                              0x1
#define _NVMCON0_NVMERR_MASK                                0x10
#define _NVMCON0_NVMEN_POSN                                 0x7
#define _NVMCON0_NVMEN_POSITION                             0x7
#define _NVMCON0_NVMEN_SIZE                                 0x1
#define _NVMCON0_NVMEN_LENGTH                               0x1
#define _NVMCON0_NVMEN_MASK                                 0x80

// Register: NVMCON1
#define NVMCON1 NVMCON1
extern volatile unsigned char           NVMCON1             __at(0xF80);
#ifndef _LIB_BUILD
asm("NVMCON1 equ 0F80h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD                     :1;
        unsigned SECRD                  :1;
        unsigned                        :2;
        unsigned WR                     :1;
        unsigned SECWR                  :1;
        unsigned SECER                  :1;
    };
} NVMCON1bits_t;
extern volatile NVMCON1bits_t NVMCON1bits __at(0xF80);
// bitfield macros
#define _NVMCON1_RD_POSN                                    0x0
#define _NVMCON1_RD_POSITION                                0x0
#define _NVMCON1_RD_SIZE                                    0x1
#define _NVMCON1_RD_LENGTH                                  0x1
#define _NVMCON1_RD_MASK                                    0x1
#define _NVMCON1_SECRD_POSN                                 0x1
#define _NVMCON1_SECRD_POSITION                             0x1
#define _NVMCON1_SECRD_SIZE                                 0x1
#define _NVMCON1_SECRD_LENGTH                               0x1
#define _NVMCON1_SECRD_MASK                                 0x2
#define _NVMCON1_WR_POSN                                    0x4
#define _NVMCON1_WR_POSITION                                0x4
#define _NVMCON1_WR_SIZE                                    0x1
#define _NVMCON1_WR_LENGTH                                  0x1
#define _NVMCON1_WR_MASK                                    0x10
#define _NVMCON1_SECWR_POSN                                 0x5
#define _NVMCON1_SECWR_POSITION                             0x5
#define _NVMCON1_SECWR_SIZE                                 0x1
#define _NVMCON1_SECWR_LENGTH                               0x1
#define _NVMCON1_SECWR_MASK                                 0x20
#define _NVMCON1_SECER_POSN                                 0x6
#define _NVMCON1_SECER_POSITION                             0x6
#define _NVMCON1_SECER_SIZE                                 0x1
#define _NVMCON1_SECER_LENGTH                               0x1
#define _NVMCON1_SECER_MASK                                 0x40

// Register: NVMCON2
#define NVMCON2 NVMCON2
extern volatile unsigned char           NVMCON2             __at(0xF81);
#ifndef _LIB_BUILD
asm("NVMCON2 equ 0F81h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMCON2                :8;
    };
} NVMCON2bits_t;
